/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_printf.c                                        :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: zabishev <zabishev@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2026/10/18 20:27:13 by zabishev          #+#    #+#             */
/*   Updated: 2026/10/18 21:12:04 by zabishev         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "ft_printf.h"

int	ft_printf(const char *q, ...)
{
	
}

int	ft_print_char(char c)
{
	return (write(1, &c, 1));//сначала печатает символ, а потом возвращает число 1 при успехе и -1 наоборот
}